{
    "characteristics": {
        "strength": "Determines physical power and effectiveness with melee weapons.",
        "intelligence": "Influences the ability to learn and use magic, as well as solve puzzles.",
        "willpower": "Affects resistance to magic and the effectiveness of restoration spells.",
        "agility": "Determines speed and effectiveness in combat, as well as the ability to evade attacks.",
        "speed": "Influences movement speed and the ability to traverse the world quickly.",
        "endurance": "Determines health and stamina, affecting the ability to sustain physical activity.",
        "personality": "Influences social interactions, including speechcraft and mercantile skills.",
        "luck": "Affects random events and the success of various actions."
    },
    "skills": {
        "long_blade": "Skill in using long bladed weapons such as swords.",
        "axe": "Skill in using axes in combat.",
        "blunt_weapon": "Skill in using blunt weapons like maces and hammers.",
        "armorer": "Skill in repairing and maintaining armor.",
        "medium_armor": "Skill in wearing and moving effectively in medium armor.",
        "heavy_armor": "Skill in wearing and moving effectively in heavy armor.",
        "spear": "Skill in using spears in combat.",
        "block": "Skill in blocking attacks with a shield or weapon.",
        "athletics": "Skill in physical activities such as running and jumping.",
        "alchemy": "Skill in creating and using potions and poisons.",
        "enchant": "Skill in enchanting items with magical properties.",
        "conjuration": "Skill in summoning creatures and casting spells related to summoning.",
        "alteration": "Skill in casting spells that alter reality, such as shields and elemental protection.",
        "destruction": "Skill in casting offensive spells that deal damage to enemies.",
        "mysticism": "Skill in understanding and using mystical spells, including detection and reflection.",
        "restoration": "Skill in casting spells that restore health and other attributes.",
        "illusion": "Skill in casting spells that affect perception and control minds.",
        "unarmored": "Skill in fighting without armor, increasing damage resistance when unarmored.",
        "acrobatics": "Skill in performing acrobatic maneuvers, such as jumping and dodging.",
        "security": "Skill in picking locks and disarming traps.",
        "sneak": "Skill in moving silently and avoiding detection.",
        "light_armor": "Skill in wearing and moving effectively in light armor.",
        "marksman": "Skill in using ranged weapons such as bows and crossbows.",
        "short_blade": "Skill in using short bladed weapons such as daggers.",
        "hand_to_hand": "Skill in fighting with bare hands.",
        "mercantile": "Skill in trading and getting better prices in shops.",
        "analysis": "Skill in analyzing and identifying items and creatures.",
        "perception": "Skill in noticing hidden objects and enemies.",
        "staff": "Skill in using staves, which are often associated with magic.",
        "speechcraft": "Skill in persuading and influencing others through speech."
    }
}